#### ZoneEquipmentBehavior Enumeration

---

|  |
| --- |
| See Also |

The behavior of zone equipment associated with spaces.

**Namespace:**   Autodesk.Revit.DB.Mechanical
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public enum ZoneEquipmentBehavior ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ZoneEquipmentBehavior ``` |

| Visual C++ |
| --- |
| ``` public enum class ZoneEquipmentBehavior ``` |

# Members

| Member name | Description |
| --- | --- |
| OnePerSpace |  |
| GroupSpaces |  |

# See Also

Autodesk.Revit.DB.Mechanical Namespace